; domain
(define (domain capp)
(:requirements :equality :strips)
(:predicates
	(orientacion ?o)
	(feature ?f)    ;operacion a realizar ejemplo s1 ,s2
    (tipo ?t)       ;tipo de operacion ej agujero
    (operacion ?op) ;tipo de maquina que se utiliza
    (feature-tipo ?f ?feat-tipo) ;combinacion de 5 y 6
    (orientacion-pieza ?oa)
    (orientacion-feature ?f ?oa) ;orientacion de la operacion
    (fabricable ?feat-tipo ?operacion)
    (fabricada ?feat)
) 

(:action setup-orientacion
 :parameters ( ?orientacion-inicial ?orientacion-final )
 :precondition
	(and 
        (orientacion-pieza ?orientacion-inicial) 
        (orientacion ?orientacion-inicial) 
        (orientacion ?orientacion-final)
    )
 :effect
	(and 
		(orientacion-pieza ?orientacion-final)
		(not (orientacion-pieza ?orientacion-inicial))
	)
)

(:action op-fresado
 :parameters ( ?o ?f ?ft ?oper )
 :precondition
	(and 
        (orientacion-pieza ?o)
        (orientacion-feature ?f ?o)
        (orientacion ?o) 
        (feature ?f)
        (tipo ?ft)
        (feature-tipo ?f ?ft)
        (fabricable ?ft ?oper)
        (operacion ?oper)
        (= ?oper fresado)
    )
 :effect
    (fabricada ?f)
)
)

; problem
(define (problem capp-pieza)
    (:domain capp)
    (:objects 
        orientacion+x
        orientacion+y
        orientacion+z
        orientacion-x
        orientacion-y
        orientacion-z
        s2
        s4
        s6
        s9
        s10
        h1
        h3
        h5
        h7
        h9
        h11
        h12
        slot
        through-hole
        blind-hole
        fresado
        taladrado
        torneado
    )
    (:init 
        (orientacion orientacion+x)
        (orientacion orientacion+y)
        (orientacion orientacion+z)
        (orientacion orientacion-x)
        (orientacion orientacion-y)
        (orientacion orientacion-z)
        (feature s2)
        (feature s4)
        (feature s6)
        (feature s9)
        (feature s10)
        (feature h1)
        (feature h3)
        (feature h5)
        (feature h7)
        (feature h9)
        (feature h11)
        (feature h12)
        (tipo slot)
        (tipo through-hole)
        (tipo blind-hole)
        (operacion fresado)
        (operacion taladrado)
        (operacion torneado)
        (feature-tipo h1  blind-hole )
        (feature-tipo h3  though-hole)
        (feature-tipo h5  though-hole)
        (feature-tipo h7  though-hole)
        (feature-tipo h9  though-hole)
        (feature-tipo h11 though-hole)
        (feature-tipo h12 though-hole)
        (feature-tipo s2 slot)
        (feature-tipo s4 slot)
        (feature-tipo s6 slot)
        (feature-tipo s9 slot)
        (feature-tipo s10 slot)
        (orientacion-pieza orientacion-x)
        (orientacion-feature h1 orientacion+z)
        (orientacion-feature s2 orientacion+x)
        (orientacion-feature s4 orientacion-x)
        (orientacion-feature s6 orientacion+x)
        (orientacion-feature s9 orientacion+z)
        (orientacion-feature s10 orientacion+z)
        (orientacion-feature h3 orientacion+z)
        (orientacion-feature h5 orientacion+z)
        (orientacion-feature h7 orientacion+x)
        (orientacion-feature h9 orientacion+x)
        (orientacion-feature h11 orientacion+x)
        (orientacion-feature h12 orientacion+x)
        (fabricable slot fresado)
        (fabricable blind-hole fresado)
        (fabricable through-hole fresado)

    )
    (:goal 
        (and
            (fabricada s2)
            (fabricada s4)
            (fabricada s6)
            (fabricada s9)
            (fabricada s10)
            (fabricada h1)
           ;(fabricada h3)
           ;(fabricada h5)
           ;(fabricada h11)
           ;(fabricada h7)
           ;(fabricada h12)
           ;(fabricada h9)

        )
    )
)

; plan
1. (op-fresado orientacion-x s4 slot fresado)
   added: (fabricada s4)
   goals met: 1 of 6
2. (setup-orientacion orientacion-x orientacion+x)
   deleted: (orientacion-pieza orientacion-x)
   added: (orientacion-pieza orientacion+x)
   goals met: 1 of 6
3. (op-fresado orientacion+x s2 slot fresado)
   added: (fabricada s2)
   goals met: 2 of 6
4. (op-fresado orientacion+x s6 slot fresado)
   added: (fabricada s6)
   goals met: 3 of 6
5. (setup-orientacion orientacion+x orientacion+z)
   deleted: (orientacion-pieza orientacion+x)
   added: (orientacion-pieza orientacion+z)
   goals met: 3 of 6
6. (op-fresado orientacion+z h1 blind-hole fresado)
   added: (fabricada h1)
   goals met: 4 of 6
7. (op-fresado orientacion+z s10 slot fresado)
   added: (fabricada s10)
   goals met: 5 of 6
8. (op-fresado orientacion+z s9 slot fresado)
   added: (fabricada s9)
   goals met: 6 of 6
